In [4]:
import pandas as pd

In [5]:
person = {
    "name" : ["James Bond", "Tim Cook", "Alan Smith"],
    "age" : [45, 65, 30],
    "city" : ["London", "LA", "NY"]
}

type(person)

dict

In [6]:
print(person)

{'name': ['James Bond', 'Tim Cook', 'Alan Smith'], 'age': [45, 65, 30], 'city': ['London', 'LA', 'NY']}

In [7]:
pd.DataFrame(person)

         name  age    city
0  James Bond   45  London
1    Tim Cook   65      LA
2  Alan Smith   30      NY